app/Controllers/Historyadmin.php

SELECT *
FROM `user`
WHERE `ID` = '2'
 LIMIT 1
SELECT *
FROM `booking`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
JOIN `statuss` ON `booking`.`B_status` = `statuss`.`S_id`
JOIN `user` ON `booking`.`B_idUser` = `user`.`ID`
WHERE `B_idUser` = '2'
ORDER BY `B_id` ASC
SELECT *
FROM `detail`
JOIN `Time` ON `detail`.`t_id` = `time`.`T_id`
ORDER BY `d_id` ASC
---
    public function historyadmin($ID = null)
    {
        helper(['form']);
        $BookingModel = new BookingModel();
        $DetailModel = new DetailModel();
        $UserModel = new UserModel();
        $data['user'] = $UserModel->where('ID',$ID)->first();
        $data['booking'] = $BookingModel->join('field','booking.B_idFeld = field.F_ID')->join('statuss','booking.B_status = statuss.S_id')->join('user','booking.B_idUser = user.ID')->where('B_idUser',$ID)->orderBy('B_id', 'Asc')->findAll();
        $data['detail'] = $DetailModel->join('Time','detail.t_id = time.T_id')->orderBy('d_id', 'Asc')->findAll();

SELECT *
FROM `user`
WHERE `ID` = '2'
 LIMIT 1
SELECT *
FROM `booking`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
JOIN `statuss` ON `booking`.`B_status` = `statuss`.`S_id`
JOIN `user` ON `booking`.`B_idUser` = `user`.`ID`
WHERE `B_idUser` = '2'
AND `S_id` IN (4,7,8)
ORDER BY `B_id` ASC
SELECT *
FROM `detail`
JOIN `Time` ON `detail`.`t_id` = `time`.`T_id`
ORDER BY `d_id` ASC
---
    public function historycancel($ID = null)
    {
        helper(['form']);
        $BookingModel = new BookingModel();
        $DetailModel = new DetailModel();
        $UserModel = new UserModel();
        $sql = "S_id IN (4,7,8)";
        $data['user'] = $UserModel->where('ID',$ID)->first();
        $data['booking'] = $BookingModel->join('field','booking.B_idFeld = field.F_ID')->join('statuss','booking.B_status = statuss.S_id')->join('user','booking.B_idUser = user.ID')->where('B_idUser',$ID)->where($sql)->orderBy('B_id', 'Asc')->findAll();
        $data['detail'] = $DetailModel->join('Time','detail.t_id = time.T_id')->orderBy('d_id', 'Asc')->findAll();

SELECT *
FROM `user`
WHERE `ID` = '2'
 LIMIT 1
SELECT *
FROM `booking`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
JOIN `statuss` ON `booking`.`B_status` = `statuss`.`S_id`
JOIN `user` ON `booking`.`B_idUser` = `user`.`ID`
WHERE `B_idUser` = '2'
AND `S_id` IN (3)
ORDER BY `B_id` ASC
SELECT *
FROM `detail`
JOIN `Time` ON `detail`.`t_id` = `time`.`T_id`
ORDER BY `d_id` ASC
---
    public function historysucceed($ID = null)
    {
        helper(['form']);
        $BookingModel = new BookingModel();
        $DetailModel = new DetailModel();
        $UserModel = new UserModel();
        $sql = "S_id IN (3)";
        $data['user'] = $UserModel->where('ID',$ID)->first();
        $data['booking'] = $BookingModel->join('field','booking.B_idFeld = field.F_ID')->join('statuss','booking.B_status = statuss.S_id')->join('user','booking.B_idUser = user.ID')->where('B_idUser',$ID)->where($sql)->orderBy('B_id', 'Asc')->findAll();
        $data['detail'] = $DetailModel->join('Time','detail.t_id = time.T_id')->orderBy('d_id', 'Asc')->findAll();

SELECT *
FROM `user`
WHERE `ID` = '2'
 LIMIT 1
SELECT *
FROM `booking`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
JOIN `statuss` ON `booking`.`B_status` = `statuss`.`S_id`
JOIN `user` ON `booking`.`B_idUser` = `user`.`ID`
WHERE `B_idUser` = '2'
AND `S_id` IN (2)
ORDER BY `B_id` ASC
SELECT *
FROM `detail`
JOIN `Time` ON `detail`.`t_id` = `time`.`T_id`
ORDER BY `d_id` ASC
---
    public function historypending($ID = null)
    {
        helper(['form']);
        $BookingModel = new BookingModel();
        $DetailModel = new DetailModel();
        $UserModel = new UserModel();
        $sql = "S_id IN (2)";
        $data['user'] = $UserModel->where('ID',$ID)->first();
        $data['booking'] = $BookingModel->join('field','booking.B_idFeld = field.F_ID')->join('statuss','booking.B_status = statuss.S_id')->join('user','booking.B_idUser = user.ID')->where('B_idUser',$ID)->where($sql)->orderBy('B_id', 'Asc')->findAll();
        $data['detail'] = $DetailModel->join('Time','detail.t_id = time.T_id')->orderBy('d_id', 'Asc')->findAll();