app/Controllers/Index_admin.php

    public function Index_admin()
    {
        helper(['form']);
        $FieldModel = new FieldModel();
        $PromotionModel = new PromotionModel();
        $TypeModel = new TypeModel();
        $BookingModel = new BookingModel();
        $X = date('m');
        $m = '%-'.$X.'-%';
        $data['booking'] = $BookingModel->join('field','booking.B_idFeld = field.F_ID')->where("B_status = 3 AND(B_day = YEAR(NOW()))")->like('B_day',$m)->orderBy('B_id', 'Asc')->findAll();
        $data['promotion'] = $PromotionModel->orderBy('p_id', 'Asc')->findAll();
        $data['type'] = $TypeModel->orderBy('T_id', 'Asc')->findAll();
        $data['field'] = $FieldModel->join('type', 'field.type = type.T_id')->join('promotion', 'field.Promotion = promotion.p_id')->join('statuss', 'field.f_status = statuss.S_id')->orderBy('F_ID', 'Asc')->findAll();
---
SELECT *
FROM `promotion`
ORDER BY `p_id` ASC
SELECT *
FROM `type`
ORDER BY `T_id` ASC
SELECT *
FROM `booking`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
WHERE `B_status` = 3
ORDER BY `B_id` ASC
SELECT *
FROM `field`
JOIN `type` ON `field`.`type` = `type`.`T_id`
JOIN `promotion` ON `field`.`Promotion` = `promotion`.`p_id`
JOIN `statuss` ON `field`.`f_status` = `statuss`.`S_id`
ORDER BY `F_ID` ASC

    public function promotion_admin()
    {
        helper(['form']);
        $PromotionModel = new PromotionModel();
        $data['promotion'] = $PromotionModel->orderBy('p_id', 'Asc')->findAll();
---
SELECT *
FROM `promotion`
ORDER BY `p_id` ASC