app/Controllers/manageuser.php

SELECT *
FROM `user`
ORDER BY `ID` ASC
---
    public function manageuser()
    {
        $UserModel = new UserModel();
        $data['user'] = $UserModel->orderby('ID','ASC')->findAll();