app/Controllers/Pay_admin.php

    public function Pay_admin() {

        helper(['form']);
        $BookingModel = new BookingModel();
        $DetailModel = new DetailModel();
        $data['booking'] = $BookingModel->join('field','booking.B_idFeld = field.F_ID')->
        join('user','booking.B_idUser = user.ID')->where('B_status',2)->orderBy('B_id', 'Asc')->findAll();

        $data['detail'] = $DetailModel->join('Time','detail.t_id = time.T_id')->orderBy('d_id', 'Asc')->findAll();
---
SELECT *
FROM `booking`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
JOIN `statuss` ON `booking`.`B_status` = `statuss`.`S_id`
JOIN `user` ON `booking`.`B_idUser` = `user`.`ID`
WHERE `B_status` IN (2,7)  AND (B_day = DATE(NOW()))
ORDER BY `B_id` ASC
SELECT *
FROM `detail`
JOIN `Time` ON `detail`.`t_id` = `time`.`T_id`
ORDER BY `d_id` ASC