app/Models/BookingModel.php

    public function totals($booking_total) {
        $data = $this->db
            ->table('booking')
            ->where("B_status = $booking_total AND (B_day = DATE(NOW()))")
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `booking`
WHERE `B_status` = 3 AND (B_day = DATE(NOW()))

    public function bookinglist($bookingstatus) {
        $data = $this->db
            ->table('booking')
            ->join('detail','booking.B_id = detail.d_id')
            ->join('time','detail.d_id = time.t_id')
            ->join('statuss','booking.B_status = statuss.S_id')
            ->join('field','booking.B_idFeld = field.F_ID')
            ->join('user','user.ID = booking.B_idUser')
            ->groupBy('B_id')
---
SELECT *
FROM `booking`
JOIN `detail` ON `booking`.`B_id` = `detail`.`d_id`
JOIN `time` ON `detail`.`d_id` = `time`.`t_id`
JOIN `statuss` ON `booking`.`B_status` = `statuss`.`S_id`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
JOIN `user` ON `user`.`ID` = `booking`.`B_idUser`
WHERE `B_status` = 3 AND (B_day = DATE(NOW()))
GROUP BY `B_id`
ORDER BY `B_id` ASC

    public function bookingall($bookingstatusall) {
        $data = $this->db
            ->table('booking')
            ->join('detail','booking.B_id = detail.d_id')
            ->join('time','detail.d_id = time.t_id')
            ->join('statuss','booking.B_status = statuss.S_id')
            ->join('field','booking.B_idFeld = field.F_ID')
            ->join('user','user.ID = booking.B_idUser')
            ->groupBy('B_id')
            ->where('B_status', $bookingstatusall)//เอาไว้ใช้ตอนเรียกดูข้อมูลการจองสำเร็จทั้งหมดในตาราง
---
SELECT *
FROM `booking`
JOIN `detail` ON `booking`.`B_id` = `detail`.`d_id`
JOIN `time` ON `detail`.`d_id` = `time`.`t_id`
JOIN `statuss` ON `booking`.`B_status` = `statuss`.`S_id`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
JOIN `user` ON `user`.`ID` = `booking`.`B_idUser`
WHERE `B_status` = 3
GROUP BY `B_id`
ORDER BY `B_id` ASC

    public function bookinglist_wait($num1,$num2) {
        $sql = "B_status IN ($num1,$num2)";
        $data = $this->db
            ->table('booking')
            ->where($sql)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `booking`
WHERE `B_status` = 2

    public function ytotal($ystatus) {
        $where = ("B_status = $ystatus AND(B_day = YEAR(NOW()))");;
        $data = $this->db
            ->table('booking')
            ->select('sum(Price * B_hour) as sumprice')
            ->join('field','booking.B_idFeld = field.F_ID')
            ->where($where)
            ->get()
            ->getResultArray();
---
SELECT sum(Price * B_hour) as sumprice
FROM `booking`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
WHERE B_status = 3 AND(B_day = YEAR(NOW()))

    public function mtotal($mstatus) {
        $X = date('m');
        $m = '%-'.$X.'-%';
        $where = ("B_status = $mstatus AND(B_day = YEAR(NOW()))");
        $data = $this->db
            ->table('booking')
            ->select('sum(Price * B_hour) as sumprice')
            ->join('field','booking.B_idFeld = field.F_ID')
            ->where($where)
            ->like('B_day',$m)
            ->get()
            ->getResultArray();
---
SELECT sum(Price * B_hour) as sumprice
FROM `booking`
JOIN `field` ON `booking`.`B_idFeld` = `field`.`F_ID`
WHERE B_status = 3 AND(B_day = YEAR(NOW()))
AND  `B_day` LIKE '%%-07-%%' ESCAPE '!'