app/Models/UserModel.php

SELECT COUNT(*) AS `numrows`
FROM `user`
---
    public function total() {
        $data = $this->db
            ->table('user')
            ->countAllResults();